ConnectTest/src/Catalogs/ИсторииЗапросов/ИсторииЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсторииЗапросов</name>
  <attributes>
    <name>Длительность</name>
    <comment>В миллисекундах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросТело</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветТело</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>CatalogRef.Токены</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/Catalogs/ИсторииЗапросов/Forms/ФормаСписка/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьТелоОтвета(ИсторияДанных)		
	СжатыеДвоичныеДанные	= ИсторияДанных.Запрос.Получить();
	Запрос	= ?(СжатыеДвоичныеДанные = Неопределено, ИсторияДанных.ЗапросТело, СериализаторXDTO.XMLЗначение(Тип("ХранилищеЗначения"), Base64Строка(СжатыеДвоичныеДанные)).Получить());
	СжатыеДвоичныеДанные	= ИсторияДанных.Ответ.Получить();
	Ответ	=  ?(СжатыеДвоичныеДанные = Неопределено, ИсторияДанных.ОтветТело, СериализаторXDTO.XMLЗначение(Тип("ХранилищеЗначения"), Base64Строка(СжатыеДвоичныеДанные)).Получить());
	Возврат Новый Структура("Запрос, Ответ", Запрос, Ответ);
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока	= Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		СтруктураОтвета	= ПолучитьТелоОтвета(ТекущаяСтрока);
		Запрос	= СтруктураОтвета.Запрос;
		Ответ	= СтруктураОтвета.Ответ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	СтандартнаяОбработка	= Ложь;
	ТекущиеДанные	= Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Токен);
		ОткрытьФорму("Справочник.Токены.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
КонецПроцедуры
